Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.1.55/atdf/ATSAML10D15A.atdf
      <value-group name="NVMCTRL_NSULCK__NSLKEY">
        <value name="KEY" caption="Write Key" value="0xA5"/>
      </value-group>
      <value-group name="NVMCTRL_PARAM__PSZ">
        <value name="8" caption="8 bytes" value="0x0"/>
        <value name="16" caption="16 bytes" value="0x1"/>
        <value name="32" caption="32 bytes" value="0x2"/>
        <value name="64" caption="64 bytes" value="0x3"/>
        <value name="128" caption="128 bytes" value="0x4"/>
        <value name="256" caption="256 bytes" value="0x5"/>
        <value name="512" caption="512 bytes" value="0x6"/>
        <value name="1024" caption="1024 bytes" value="0x7"/>
      </value-group>
      <value-group name="NVMCTRL_SECCTRL__KEY">
        <value name="KEY" caption="Write Key" value="0xA5"/>
      </value-group>
    </module>
    <module name="FUSES" id="U2802" version="1.0.0" caption="Non-Volatile Fuses">
      <register-group name="BOCOR_FUSES">
        <register name="BOCOR_WORD_1" offset="0x4" rw="RW" size="4" initval="0xFFFFFF00" caption="BOCOR Page Word 1">
          <bitfield name="IDAU_BOOTPROT" caption="Boot Protection" mask="0xFF"/>
        </register>
        <register name="BOCOR_WORD_16" offset="0x40" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 16">
          <bitfield name="BOOTROM_CRCKEY_0" caption="CRC Key bits 31:0" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_17" offset="0x44" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 17">
          <bitfield name="BOOTROM_CRCKEY_1" caption="CRC Key bits 63:32" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_18" offset="0x48" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 18">
          <bitfield name="BOOTROM_CRCKEY_2" caption="CRC Key bits 95:64" mask="0xFFFFFFFF"/>
        </register>
        <register name="BOCOR_WORD_19" offset="0x4C" rw="RW" size="4" initval="0xFFFFFFFF" caption="BOCOR Page Word 19">
          <bitfield name="BOOTROM_CRCKEY_3" caption="CRC Key bits 127:96" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <register-group name="SW_CALIB_FUSES">
        <register name="SW_CALIB_WORD_0" offset="0x0" rw="R" size="4" caption="SW_CALIB Page Word 0">
          <bitfield name="ADC_BIASREFBUF" caption="ADC Bias Reference Buffer Scaling" mask="0x7"/>
          <bitfield name="ADC_BIASCOMP" caption="ADC Comparator Scaling" mask="0x38"/>
          <bitfield name="DFLLULP_DIV_PL0" caption="DFLLULP DIV at PL0" mask="0x1C0"/>
          <bitfield name="DFLLULP_DIV_PL2" caption="DFLLULP DIV at PL2" mask="0xE00"/>
        </register>
      </register-group>
      <register-group name="TEMP_LOG_FUSES">
        <register name="TEMP_LOG_WORD_0" offset="0x0" rw="R" size="4" caption="TEMP_LOG Page Word 0">
          <bitfield name="ROOM_TEMP_VAL_INT" caption="Integer part of room temperature in oC" mask="0xFF"/>
          <bitfield name="ROOM_TEMP_VAL_DEC" caption="Decimal part of room temperature" mask="0xF00"/>
          <bitfield name="HOT_TEMP_VAL_INT" caption="Integer part of hot temperature in oC" mask="0xFF000"/>
          <bitfield name="HOT_TEMP_VAL_DEC" caption="Decimal part of hot temperature" mask="0xF00000"/>
          <bitfield name="ROOM_INT1V_VAL" caption="2's complement of the internal 1V reference drift at room temperature (versus a 1.0 centered value)" mask="0xFF000000"/>
        </register>
        <register name="TEMP_LOG_WORD_1" offset="0x4" rw="R" size="4" caption="TEMP_LOG Page Word 1">
          <bitfield name="HOT_INT1V_VAL" caption="2's complement of the internal 1V reference drift at hot temperature (versus a 1.0 centered value)" mask="0xFF"/>
          <bitfield name="ROOM_ADC_VAL_PTAT" caption="12-bit ADC conversion at room temperature PTAT" mask="0xFFF00"/>
          <bitfield name="HOT_ADC_VAL_PTAT" caption="12-bit ADC conversion at hot temperature PTAT" mask="0xFFF00000"/>
        </register>
      </register-group>
      <register-group name="USER_FUSES">
        <register name="USER_WORD_0" offset="0x0" rw="RW" size="4" initval="0xB1FF437F" caption="USER Page Word 0">
          <bitfield name="NVMCTRL_NSULCK" caption="NVM Non-Secure Region Locks" mask="0x38"/>
          <bitfield name="BOD33_LEVEL" caption="BOD33 threshold Level" mask="0x1F80"/>
          <bitfield name="BOD33_DIS" caption="BOD33 Disable" mask="0x2000"/>
          <bitfield name="BOD33_ACTION" caption="BOD33 Action" mask="0xC000" values="SUPC_BOD33__ACTION"/>
          <bitfield name="WDT_RUNSTDBY" caption="WDT Run During Standby" mask="0x2000000"/>
          <bitfield name="WDT_ENABLE" caption="WDT Enable" mask="0x4000000"/>
          <bitfield name="WDT_ALWAYSON" caption="WDT Always On" mask="0x8000000"/>
          <bitfield name="WDT_PER" caption="WDT Period" mask="0xF0000000" values="WDT_CONFIG__PER"/>
        </register>
        <register name="USER_WORD_1" offset="0x4" rw="RW" size="4" initval="0xFFFFFCBB" caption="USER Page Word 1">
          <bitfield name="WDT_WINDOW" caption="WDT Window" mask="0xF" values="WDT_CONFIG__WINDOW"/>
          <bitfield name="WDT_EWOFFSET" caption="WDT Early Warning Offset" mask="0xF0" values="WDT_EWCTRL__EWOFFSET"/>
          <bitfield name="WDT_WEN" caption="WDT Window Mode Enable" mask="0x100"/>
          <bitfield name="BOD33_HYST" caption="BOD33 Hysteresis" mask="0x200"/>
        </register>
      </register-group>
      <value-group name="SUPC_BOD33__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
        <value name="INT" caption="The BOD33 generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="WDT_CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
