Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.1.55/atdf/ATSAML10D15A.atdf
      <value-group name="OPAMP_OPAMPCTRL__BIAS">
        <value name="MODE0" caption="Minimum current consumption, but the slowest mode" value="0"/>
        <value name="MODE1" caption="Low current consumption, slow speed" value="1"/>
        <value name="MODE2" caption="High current consumption, fast speed" value="2"/>
        <value name="MODE3" caption="Maximum current consumption but the fastest mode" value="3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL0__RES1MUX">
        <value name="OAxPOS" caption="Positive inout of OPAMPx" value="0"/>
        <value name="OAxNEG" caption="Negative input of OPAMPx" value="1"/>
        <value name="DAC" caption="DAC output" value="2"/>
        <value name="GND" caption="Ground" value="3"/>
        <value name="RG_CONN" caption="RG_CONN" value="4"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL1__RES1MUX">
        <value name="OAxPOS" caption="Positive inout of OPAMPx" value="0"/>
        <value name="OAxNEG" caption="Negative input of OPAMPx" value="1"/>
        <value name="OA0OUT" caption="OPAMP0 output" value="2"/>
        <value name="GND" caption="Ground" value="3"/>
        <value name="RG_CONN" caption="RG_CONN" value="4"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL2__RES1MUX">
        <value name="OAxPOS" caption="Positive inout of OPAMPx" value="0"/>
        <value name="OAxNEG" caption="Negative input of OPAMPx" value="1"/>
        <value name="OA1OUT" caption="OPAMP1 output" value="2"/>
        <value name="GND" caption="Ground" value="3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL__POTMUX">
        <value name="14R_2R" caption="R1 = 14R, R2 = 2R" value="0"/>
        <value name="12R_4R" caption="R1 = 12R, R2 = 4R" value="1"/>
        <value name="8R_8R" caption="R1 = 8R, R2 = 8R" value="2"/>
        <value name="6R_10R" caption="R1 = 6R, R2 = 10R" value="3"/>
        <value name="4R_12R" caption="R1 = 4R, R2 = 12R" value="4"/>
        <value name="3R_13R" caption="R1 = 3R, R2 = 13R" value="5"/>
        <value name="2R_14R" caption="R1 = 2R, R2 = 14R" value="6"/>
        <value name="R_15R" caption="R1 = 1R, R2 = 15R" value="7"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL0__MUXPOS">
        <value name="OA0POS" caption="Positive I/O pin" value="0"/>
        <value name="OA0TAP" caption="Resistor ladder 0 taps" value="1"/>
        <value name="REFERENCE_DAC" caption="REFERENCE or DAC output" value="2"/>
        <value name="GND" caption="Ground" value="3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL1__MUXPOS">
        <value name="OA1POS" caption="Positive I/O pin" value="0"/>
        <value name="OA1TAP" caption="Resistor ladder 1 taps" value="1"/>
        <value name="REFERENCE_DAC" caption="REFERENCE or DAC output" value="2"/>
        <value name="GND" caption="Ground" value="3"/>
        <value name="OA0OUT" caption="OPAMP0 output" value="4"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL2__MUXPOS">
        <value name="OA2POS" caption="Positive I/O pin" value="0"/>
        <value name="OA2TAP" caption="Resistor ladder 2 taps" value="1"/>
        <value name="REFERENCE_DAC" caption="REFERENCE or DAC output" value="2"/>
        <value name="GND" caption="Ground" value="3"/>
        <value name="OA1OUT" caption="OPAMP1 output" value="4"/>
        <value name="OA0POS" caption="Positive I/O pin OPA0" value="5"/>
        <value name="OA1POS" caption="Positive I/O pin OPA1" value="6"/>
        <value name="OA0TAP" caption="OPAMP0 Resistor Ladder Taps" value="7"/>
        <value name="RES3TAP" caption="Resistor ladder 3 taps" value="7"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL0__MUXNEG">
        <value name="OA0NEG" caption="Negative I/O pin" value="0"/>
        <value name="OA0TAP" caption="Resistor ladder 0 taps" value="1"/>
        <value name="REFERENCE_DAC" caption="REFERENCE or DAC output" value="2"/>
        <value name="OA0OUT" caption="OPAMP0 output" value="3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL1__MUXNEG">
        <value name="OA1NEG" caption="Negative I/O pin" value="0"/>
        <value name="OA1TAP" caption="Resistor ladder 1 taps" value="1"/>
        <value name="REFERENCE_DAC" caption="REFERENCE or DAC output" value="2"/>
        <value name="OA1OUT" caption="OPAMP1 output" value="3"/>
      </value-group>
      <value-group name="OPAMP_OPAMPCTRL2__MUXNEG">
        <value name="OA2NEG" caption="Negative I/O pin" value="0"/>
        <value name="OA2TAP" caption="Resistor ladder 2 taps" value="1"/>
        <value name="REFERENCE_DAC" caption="REFERENCE or DAC output" value="2"/>
        <value name="OA2OUT" caption="OPAMP2 output" value="3"/>
        <value name="OA0NEG" caption="Negative I/O pin OPA0" value="4"/>
        <value name="OA1NEG" caption="Negative I/O pin OPA1" value="5"/>
      </value-group>
      <value-group name="OPAMP_RESCTRL__REFBUFLEVEL">
        <value name="1_1v" caption="1.1v" value="0"/>
        <value name="1_25v" caption="1.25v" value="1"/>
        <value name="1_6v" caption="1.6v" value="2"/>
      </value-group>
      <value-group name="OPAMP_RESCTRL__POTMUX">
        <value name="14R_2R" caption="Gain = 0.14" value="0"/>
        <value name="12R_4R" caption="Gain = 0.33" value="1"/>
        <value name="8R_8R" caption="Gain = 1" value="2"/>
        <value name="6R_10R" caption="Gain = 1.67" value="3"/>
        <value name="4R_12R" caption="Gain = 3" value="4"/>
        <value name="3R_13R" caption="Gain = 4.33" value="5"/>
        <value name="2R_14R" caption="Gain = 7" value="6"/>
        <value name="R_15R" caption="Gain = 15" value="7"/>
      </value-group>
      <value-group name="OPAMP_RESCTRL__RES1MUX">
        <value name="DAC" caption="DAC output" value="0"/>
        <value name="REFBUF" caption="REFERENCE output" value="1"/>
      </value-group>
    </module>
    <module name="OSCCTRL" id="U2119" version="4.0.0" caption="Oscillators Control">
      <register-group name="OSCCTRL" caption="Oscillators Control">
        <register name="EVCTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="CFDEO" caption="Clock Failure Detector Event Output Enable" mask="0x1"/>
          <bitfield name="TUNEEI" caption="Tune Event Input Enable" mask="0x2"/>
          <bitfield name="TUNEINV" caption="Tune Event Input Invert" mask="0x4"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DFLLULPRDY" caption="DFLLULP Ready interrupt Enable" mask="0x100"/>
          <bitfield name="DFLLULPLOCK" caption="DFLLULP Lock Interrupt Enable" mask="0x200"/>
          <bitfield name="DFLLULPNOLOCK" caption="DFLLULP No Lock Interrupt Enable" mask="0x400"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x20000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout Interrupt Enable" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Loop Divider Ratio Update Complete Interrupt Enable" mask="0x80000"/>
        </register>
        <register name="INTENSET" offset="0x8" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector Interrupt Enable" mask="0x2"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DFLLULPRDY" caption="DFLLULP Ready interrupt Enable" mask="0x100"/>
          <bitfield name="DFLLULPLOCK" caption="DFLLULP Lock Interrupt Enable" mask="0x200"/>
          <bitfield name="DFLLULPNOLOCK" caption="DFLLULP No Lock Interrupt Enable" mask="0x400"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x20000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout Interrupt Enable" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Loop Divider Ratio Update Complete Interrupt Enable" mask="0x80000"/>
        </register>
        <register name="INTFLAG" offset="0xC" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector" mask="0x2"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready" mask="0x10"/>
          <bitfield name="DFLLULPRDY" caption="DFLLULP Ready" mask="0x100"/>
          <bitfield name="DFLLULPLOCK" caption="DFLLULP Lock" mask="0x200"/>
          <bitfield name="DFLLULPNOLOCK" caption="DFLLULP No Lock" mask="0x400"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x20000"/>
          <bitfield name="DPLLLTO" caption="DPLL Lock Timeout" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Loop Divider Ratio Update Complete" mask="0x80000"/>
        </register>
        <register name="STATUS" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Status">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector" mask="0x2"/>
          <bitfield name="XOSCCKSW" caption="XOSC Clock Switch" mask="0x4"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready" mask="0x10"/>
          <bitfield name="DFLLULPRDY" caption="DFLLULP Ready" mask="0x100"/>
          <bitfield name="DFLLULPLOCK" caption="DFLLULP Lock" mask="0x200"/>
          <bitfield name="DFLLULPNOLOCK" caption="DFLLULP No Lock" mask="0x400"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x20000"/>
          <bitfield name="DPLLTO" caption="DPLL Lock Timeout" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Loop Divider Ratio Update Complete" mask="0x80000"/>
        </register>
        <register name="XOSCCTRL" offset="0x14" rw="RW" size="2" initval="0x0080" caption="External Multipurpose Crystal Oscillator (XOSC) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="CFDEN" caption="Clock Failure Detector Enable" mask="0x8"/>
          <bitfield name="SWBEN" caption="Xosc Clock Switch Enable" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="GAIN" caption="Oscillator Gain" mask="0x700" values="OSCCTRL_XOSCCTRL__GAIN"/>
          <bitfield name="AMPGC" caption="Automatic Amplitude Gain Control" mask="0x800"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF000" values="OSCCTRL_XOSCCTRL__STARTUP"/>
        </register>
        <register name="CFDPRESC" offset="0x16" rw="RW" size="1" initval="0x00" caption="Clock Failure Detector Prescaler">
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0x7" values="OSCCTRL_CFDPRESC__CFDPRESC"/>
        </register>
        <register name="OSC16MCTRL" offset="0x18" rw="RW" size="1" initval="0x82" caption="16MHz Internal Oscillator (OSC16M) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="FSEL" caption="Oscillator Frequency Selection" mask="0xC" values="OSCCTRL_OSC16MCTRL__FSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="DFLLULPCTRL" offset="0x1C" rw="RW" access="WSYNC" size="2" initval="0x0504" caption="DFLLULP Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="BINSE" caption="Binary Search Enable" mask="0x8"/>
          <bitfield name="SAFE" caption="Tuner Safe Mode" mask="0x10"/>
          <bitfield name="DITHER" caption="Tuner Dither Mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand" mask="0x80"/>
          <bitfield name="DIV" caption="Division Factor" mask="0x700" values="OSCCTRL_DFLLULPCTRL__DIV"/>
        </register>
        <register name="DFLLULPDITHER" offset="0x1E" rw="RW" size="1" initval="0x00" caption="DFLLULP Dither Control">
          <bitfield name="STEP" caption="Dither Step" mask="0x7" values="OSCCTRL_DFLLULPDITHER__STEP"/>
          <bitfield name="PER" caption="Dither Period" mask="0x70" values="OSCCTRL_DFLLULPDITHER__PER"/>
        </register>
        <register name="DFLLULPRREQ" offset="0x1F" rw="RW" size="1" initval="0x00" caption="DFLLULP Read Request">
          <bitfield name="RREQ" caption="Read Request" mask="0x80"/>
        </register>
        <register name="DFLLULPDLY" offset="0x20" rw="RW" access="WSYNC" size="4" initval="0x00000080" caption="DFLLULP Delay Value">
          <bitfield name="DELAY" caption="Delay Value" mask="0xFF"/>
        </register>
        <register name="DFLLULPRATIO" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="DFLLULP Target Ratio">
          <bitfield name="RATIO" caption="Target Tuner Ratio" mask="0x7FF"/>
        </register>
        <register name="DFLLULPSYNCBUSY" offset="0x28" rw="R" size="4" initval="0x00000000" caption="DFLLULP Synchronization Busy">
          <bitfield name="ENABLE" caption="Enable Bit Synchronization Busy" mask="0x2"/>
          <bitfield name="DELAY" caption="Delay Register Synchronization Busy" mask="0x8"/>
        </register>
        <register name="DPLLCTRLA" offset="0x2C" rw="RW" access="WSYNC" size="1" initval="0x80" caption="DPLL Control A">
          <bitfield name="ENABLE" caption="DPLL Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Clock Activation" mask="0x80"/>
        </register>
        <register name="DPLLRATIO" offset="0x30" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="DPLL Ratio Control">
          <bitfield name="LDR" caption="Loop Divider Ratio" mask="0xFFF"/>
          <bitfield name="LDRFRAC" caption="Loop Divider Ratio Fractional Part" mask="0xF0000"/>
        </register>
        <register name="DPLLCTRLB" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="DPLL Control B">
          <bitfield name="FILTER" caption="Proportional Integral Filter Selection" mask="0x3" values="OSCCTRL_DPLLCTRLB__FILTER"/>
          <bitfield name="LPEN" caption="Low-Power Enable" mask="0x4"/>
          <bitfield name="WUF" caption="Wake Up Fast" mask="0x8"/>
          <bitfield name="REFCLK" caption="Reference Clock Selection" mask="0x30" values="OSCCTRL_DPLLCTRLB__REFCLK"/>
          <bitfield name="LTIME" caption="Lock Time" mask="0x700" values="OSCCTRL_DPLLCTRLB__LTIME"/>
          <bitfield name="LBYPASS" caption="Lock Bypass" mask="0x1000"/>
          <bitfield name="DIV" caption="Clock Divider" mask="0x7FF0000"/>
        </register>
