Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML10_DFP/3.1.55/atdf/ATSAML10D15A.atdf
        <register name="NONSECB" offset="0x58" rw="R" size="4" initval="0x00000002" caption="Peripheral non-secure status - Bridge B">
          <bitfield name="IDAU_" caption="IDAU Non-Secure" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU Non-Secure" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL Non-Secure" mask="0x4"/>
          <bitfield name="DMAC_" caption="DMAC Non-Secure" mask="0x8"/>
        </register>
        <register name="NONSECC" offset="0x5C" rw="R" size="4" initval="0x00000000" caption="Peripheral non-secure status - Bridge C">
          <bitfield name="EVSYS_" caption="EVSYS Non-Secure" mask="0x1"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 Non-Secure" mask="0x2"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 Non-Secure" mask="0x4"/>
          <bitfield name="TC0_" caption="TC0 Non-Secure" mask="0x10"/>
          <bitfield name="TC1_" caption="TC1 Non-Secure" mask="0x20"/>
          <bitfield name="TC2_" caption="TC2 Non-Secure" mask="0x40"/>
          <bitfield name="ADC_" caption="ADC Non-Secure" mask="0x80"/>
          <bitfield name="DAC_" caption="DAC Non-Secure" mask="0x100"/>
          <bitfield name="PTC_" caption="PTC Non-Secure" mask="0x200"/>
          <bitfield name="TRNG_" caption="TRNG Non-Secure" mask="0x400"/>
          <bitfield name="CCL_" caption="CCL Non-Secure" mask="0x800"/>
          <bitfield name="OPAMP_" caption="OPAMP Non-Secure" mask="0x1000"/>
          <bitfield name="TRAM_" caption="TRAM Non-Secure" mask="0x2000"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLEAR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="LOCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
    <module name="PM" id="U2240" version="3.1.0" caption="Power Manager">
      <register-group name="PM" caption="Power Manager">
        <register name="SLEEPCFG" offset="0x1" rw="RW" size="1" initval="0x02" caption="Sleep Configuration">
          <bitfield name="SLEEPMODE" caption="Sleep Mode" mask="0x7" values="PM_SLEEPCFG__SLEEPMODE"/>
        </register>
        <register name="PLCFG" offset="0x2" rw="RW" size="1" initval="0x00" caption="Performance Level Configuration">
          <bitfield name="PLSEL" caption="Performance Level Select" mask="0x3" values="PM_PLCFG__PLSEL"/>
          <bitfield name="PLDIS" caption="Performance Level Disable" mask="0x80"/>
        </register>
        <register name="PWCFG" offset="0x3" rw="RW" size="1" initval="0x00" caption="Power Configuration">
          <bitfield name="RAMPSWC" caption="RAM Power Switch Configuration" mask="0x3" values="PM_PWCFG__RAMPSWC"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="PLRDY" caption="Performance Level Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="PLRDY" caption="Performance Level Ready interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="PLRDY" caption="Performance Level Ready" mask="0x1"/>
        </register>
        <register name="STDBYCFG" offset="0x8" rw="RW" size="2" initval="0x0000" caption="Standby Configuration">
          <bitfield name="PDCFG" caption="Power Domain Configuration" mask="0x1" values="PM_STDBYCFG__PDCFG"/>
          <bitfield name="DPGPDSW" caption="Dynamic Power Gating for PDSW" mask="0x10" values="PM_STDBYCFG__DPGPDSW"/>
          <bitfield name="VREGSMOD" caption="Voltage Regulator Standby mode" mask="0xC0" values="PM_STDBYCFG__VREGSMOD"/>
          <bitfield name="BBIASHS" caption="Back Bias for HSRAM" mask="0x400"/>
          <bitfield name="BBIASTR" caption="Back Bias for Trust RAM" mask="0x1000"/>
        </register>
      </register-group>
      <value-group name="PM_SLEEPCFG__SLEEPMODE">
        <value name="IDLE" caption="CPU, AHB, APB clocks are OFF" value="2"/>
        <value name="STANDBY" caption="All Clocks are OFF" value="4"/>
        <value name="OFF" caption="All power domains are powered OFF" value="6"/>
      </value-group>
      <value-group name="PM_PLCFG__PLSEL">
        <value name="PL0" caption="Performance Level 0" value="0x0"/>
        <value name="PL2" caption="Performance Level 2" value="0x2"/>
      </value-group>
      <value-group name="PM_PWCFG__RAMPSWC">
        <value name="16KB" caption="16KB Available" value="0x0"/>
        <value name="12KB" caption="12KB Available" value="0x1"/>
        <value name="8KB" caption="8KB Available" value="0x2"/>
        <value name="4KB" caption="4KB Available" value="0x3"/>
      </value-group>
      <value-group name="PM_STDBYCFG__DPGPDSW">
        <value name="0" caption="Dynamic Power Gating disabled" value="0"/>
        <value name="1" caption="Dynamic Power Gating enabled" value="1"/>
      </value-group>
      <value-group name="PM_STDBYCFG__PDCFG">
        <value name="DEFAULT" caption="PDSW power domain switching is handled by hardware." value="0"/>
        <value name="PDSW" caption="PDSW is forced ACTIVE." value="1"/>
      </value-group>
      <value-group name="PM_STDBYCFG__VREGSMOD">
        <value name="AUTO" caption="Automatic mode" value="0"/>
        <value name="PERFORMANCE" caption="Performance oriented" value="1"/>
        <value name="LP" caption="Low Power oriented" value="2"/>
      </value-group>
    </module>
    <module name="PORT" id="U2210" version="3.0.0" caption="Port Module">
      <register-group name="GROUP" size="0x80">
        <register name="DIR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Data Direction">
          <bitfield name="DIR" caption="Port Data Direction" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:DIR" initval="0x00000000" caption="Data Direction Clear">
          <bitfield name="DIRCLR" caption="Port Data Direction Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRSET" offset="0x8" rw="RW" size="4" atomic-op="set:DIR" initval="0x00000000" caption="Data Direction Set">
          <bitfield name="DIRSET" caption="Port Data Direction Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="DIRTGL" offset="0xC" rw="RW" size="4" atomic-op="toggle:DIR" initval="0x00000000" caption="Data Direction Toggle">
          <bitfield name="DIRTGL" caption="Port Data Direction Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Data Output Value">
          <bitfield name="OUT" caption="PORT Data Output Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTCLR" offset="0x14" rw="RW" size="4" atomic-op="clear:OUT" initval="0x00000000" caption="Data Output Value Clear">
          <bitfield name="OUTCLR" caption="PORT Data Output Value Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTSET" offset="0x18" rw="RW" size="4" atomic-op="set:OUT" initval="0x00000000" caption="Data Output Value Set">
          <bitfield name="OUTSET" caption="PORT Data Output Value Set" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTTGL" offset="0x1C" rw="RW" size="4" atomic-op="toggle:OUT" initval="0x00000000" caption="Data Output Value Toggle">
          <bitfield name="OUTTGL" caption="PORT Data Output Value Toggle" mask="0xFFFFFFFF"/>
        </register>
        <register name="IN" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Data Input Value">
          <bitfield name="IN" caption="PORT Data Input Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CTRL" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SAMPLING" caption="Input Sampling Mode" mask="0xFFFFFFFF"/>
        </register>
